Revit 2027 API
Pipe.IsPipingSystemTypeId Method
 Checks if given type is valid piping system type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsPipingSystemTypeId(
	Document document,
	ElementId systemTypeId
)
Public Shared Function IsPipingSystemTypeId (
	document As Document,
	systemTypeId As ElementId
) As Boolean
public:
static bool IsPipingSystemTypeId(
	Document^ document,
	ElementId^ systemTypeId
)
static member IsPipingSystemTypeId :
        document : Document *
        systemTypeId : ElementId -> bool
Parameters
document Document
 The document.
systemTypeId ElementId
 ElementId of the piping system type to check.
Return Value
Boolean
 True if the given systemTypeId is the piping system type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace